/***************************************************************************************************
 * Author: yjrqz777 3210551161@qq.com
 * Date: 2025-05-26 21:03:02
 * LastEditTime: 2025-07-23 20:26:57
 * LastEditors: yjrqz777 3210551161@qq.com
 * Description:
 * FilePath: \g474app\My_Lib\Task.h
 * @YJRQZ777
 ***************************************************************************************************/
#ifndef __TASK_H__
#define __TASK_H__

#include "main.h"


#define TASK_MAX 20
#define TIME_ms 10 // 定时器时间间隔，单位为毫秒

extern unsigned int PT_TICK[TASK_MAX];/* global var */

#define PT_WAITING 0
#define PT_YIELDED 1
#define PT_EXITED 2
#define PT_ENDED 3


/***************************************************************************************************
 * 功能描述: 
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 
 * 其它说明: TIME_ms:定时器时间间隔
***************************************************************************************************/
/* 

*****************************************************************************************************
unsigned int PT_TICK[TASK_MAX]={0};

void time1ms(void)
{
    TASK_TICK_UPDATE();
}

*****************************************************************************************************
static int PT_TASK_TEST()
{
  //A protothread function must begin with PT_BEGIN() which takes apointer to a struct pt.
  PT_BEGIN()
  {
    //run once;
    printf("01\n");
  }
  //We loop forever here.
  while(1) 
  {
    printf("1\n");
    //Wait until the other protothread has set its flag.
    printf("2\n");
    PT_WAIT_UNTIL(500/TIME_ms);
    printf("3\n");
    PT_WAIT_UNTIL(1500);
    printf("4\n");
    //And we loop.
  }
    printf("5\n");
    PT_END();
}

//*****************************************************************************************************
//在while执行， 注册Pt任务,及载入
PT_TASK_REG(0,PT_TASK_TEST);



*/

/***************************************************************************************************
 * 功能描述: 注册任务
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 
 * 其它说明: 
***************************************************************************************************/
#define PT_TASK_REG(Rank, Func)   \
    do                            \
    {                             \
        if (Rank >= TASK_MAX)     \
        {                         \
            break;                \
        }                         \
        if (PT_TICK[Rank] == 0)     \
        {                         \
            PT_TICK[Rank] = Func(); \
        }                         \
    } while (0)
/***************************************************************************************************
 * 功能描述: 更新时机
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 
 * 其它说明: 定时器定时运行
***************************************************************************************************/
#define TASK_TICK_UPDATE()                                \
    do                                               \
    {                                                \
        for (unsigned char i = 0; i < TASK_MAX; i++) \
        {                                            \
            if (PT_TICK[i] > 0)                  \
            {                                        \
                PT_TICK[i]--;                    \
            }                                        \
        }                                            \
    } while (0)
/***************************************************************************************************
 * 功能描述: 
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 
 * 其它说明: 
***************************************************************************************************/
#define PT_BEGIN()            \
    {                           \
        char PT_YIELD_FLAG = 1; static unsigned int pt_lc = 0; static unsigned int u32WiatTime_save = 0; \
        switch (pt_lc)       \
        {                       \
        default:
/***************************************************************************************************
 * 功能描述: 
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 
 * 其它说明: 
***************************************************************************************************/
#define PT_END()     \
    }                  \
    ;                  \
    PT_YIELD_FLAG = 0; \
    pt_lc = 0;      \
    return PT_ENDED;   \
    }
/***************************************************************************************************
 * 功能描述: 
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 
 * 其它说明: 
***************************************************************************************************/
#define PT_WAIT_UNTIL(u32WiatTime) \
    do                              \
    {                               \
        u32WiatTime_save = u32WiatTime; \
        pt_lc = __LINE__;        \
        return u32WiatTime;            \
    } while (0);                    \
    case __LINE__:;
/***************************************************************************************************
 * 功能描述: PT任务重新运行
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 
 * 其它说明: 会重新运行PT_BEGIN(){}
***************************************************************************************************/
#define PT_RESTART()     \
    do                     \
    {                      \
        pt_lc = 0;      \
        return PT_WAITING; \
    } while (0)
/***************************************************************************************************
 * 功能描述: 退出Pt任务，重新计时
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 
 * 其它说明: 
***************************************************************************************************/
#define PT_EXIT()       \
    do                    \
    {                     \
        return u32WiatTime_save; \
    } while (0)
/***************************************************************************************************
 * 功能描述: 
 * 输入参数: 
 * 输出参数: 
 * 返 回 值: 
 * 其它说明: 
***************************************************************************************************/
// #define PT_SCHEDULE(f) ((f) < PT_EXITED)

// #define PT_YIELD(pt)            \
//     do                          \
//     {                           \
//         PT_YIELD_FLAG = 0;      \
//         pt_lc = __LINE__;    \
//     case __LINE__:;             \
//         if (PT_YIELD_FLAG == 0) \
//         {                       \
//             return PT_YIELDED;  \
//         }                       \
//     } while (0)

// #define PT_YIELD_UNTIL(pt, cond)             \
//     do                                       \
//     {                                        \
//         PT_YIELD_FLAG = 0;                   \
//         pt_lc = __LINE__;                 \
//     case __LINE__:;                          \
//         if ((PT_YIELD_FLAG == 0) || !(cond)) \
//         {                                    \
//             return PT_YIELDED;               \
//         }                                    \
//     } while (0)

#endif
